In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv(r"C:\Users\Admin\Documents\DILIP\ML Files\data1.csv")
df

    Name  Python  Machine Learning
0    jay    90.0               NaN
1    raj     NaN              89.0
2  kumar    78.0              78.0
3  suraj     NaN               NaN
4  pawan     NaN              87.0
5  viraj    65.0              56.0
6  vijay    45.0              67.0
7  sumit    80.0              45.0
8  akash    70.0              67.0
9  sujit     NaN               NaN

In [3]:
#Nan = not a number

In [4]:
type(np.nan)

float

In [5]:
df.isna()

    Name  Python  Machine Learning
0  False   False              True
1  False    True             False
2  False   False             False
3  False    True              True
4  False    True             False
5  False   False             False
6  False   False             False
7  False   False             False
8  False   False             False
9  False    True              True

In [6]:
df.isna().sum()

Name                0
Python              4
Machine Learning    3
dtype: int64

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Name              10 non-null     object
 1   Python            6 non-null      float64
 2   Machine Learning  7 non-null      float64
dtypes: float64(2), object(1)
memory usage: 368.0+ bytes

In [8]:
df.dropna()

    Name  Python  Machine Learning
2  kumar    78.0              78.0
5  viraj    65.0              56.0
6  vijay    45.0              67.0
7  sumit    80.0              45.0
8  akash    70.0              67.0

In [9]:
df

    Name  Python  Machine Learning
0    jay    90.0               NaN
1    raj     NaN              89.0
2  kumar    78.0              78.0
3  suraj     NaN               NaN
4  pawan     NaN              87.0
5  viraj    65.0              56.0
6  vijay    45.0              67.0
7  sumit    80.0              45.0
8  akash    70.0              67.0
9  sujit     NaN               NaN

In [10]:
df.dropna(how='all')

    Name  Python  Machine Learning
0    jay    90.0               NaN
1    raj     NaN              89.0
2  kumar    78.0              78.0
3  suraj     NaN               NaN
4  pawan     NaN              87.0
5  viraj    65.0              56.0
6  vijay    45.0              67.0
7  sumit    80.0              45.0
8  akash    70.0              67.0
9  sujit     NaN               NaN

In [13]:
df.dropna(how='all',subset=["Python","Machine Learning"])

    Name  Python  Machine Learning
0    jay    90.0               NaN
1    raj     NaN              89.0
2  kumar    78.0              78.0
4  pawan     NaN              87.0
5  viraj    65.0              56.0
6  vijay    45.0              67.0
7  sumit    80.0              45.0
8  akash    70.0              67.0

In [14]:
df.fillna(0)

    Name  Python  Machine Learning
0    jay    90.0               0.0
1    raj     0.0              89.0
2  kumar    78.0              78.0
3  suraj     0.0               0.0
4  pawan     0.0              87.0
5  viraj    65.0              56.0
6  vijay    45.0              67.0
7  sumit    80.0              45.0
8  akash    70.0              67.0
9  sujit     0.0               0.0

In [17]:
pmean=df["Python"].mean()
pmean
mlmean=df["Machine Learning"].mean()
mlmean

69.85714285714286

In [18]:
pmean=df["Python"].median()
pmean
mlmean=df["Machine Learning"].median()
mlmean

67.0

In [19]:
df["Python"].fillna(pmean)
df["Machine Learning"].fillna(mlmean)

0    90.0
1    74.0
2    78.0
3    74.0
4    74.0
5    65.0
6    45.0
7    80.0
8    70.0
9    74.0
Name: Python, dtype: float64

In [20]:
df.isna().sum()/len(df)*100

Name                 0.0
Python              40.0
Machine Learning    30.0
dtype: float64

In [21]:
df["Python"].fillna(pmean,inplace=True)
df["Machine Learning"].fillna(mlmean,inplace=True)

In [22]:
df

    Name  Python  Machine Learning
0    jay    90.0              67.0
1    raj    74.0              89.0
2  kumar    78.0              78.0
3  suraj    74.0              67.0
4  pawan    74.0              87.0
5  viraj    65.0              56.0
6  vijay    45.0              67.0
7  sumit    80.0              45.0
8  akash    70.0              67.0
9  sujit    74.0              67.0

In [24]:
# tatal column can be add

In [25]:
import matplotlib.pyplot as plt
import seaborn as sns 

import warnings 
warnings.filterwarnings("ignore")

In [29]:
sns.blend_palette(df["Python"])
plt.show

ValueError: Invalid RGBA argument: 90.0